{"data": [{"title": "Martial Peak", "poster": "https://readm.today/uploads/chapter_files/cover/tbn/1609673137_198x0.jpg", "desc": "The journey to the martial peak is a lonely, solitary and long one.In the face of adversity,you must survive and remain unyielding.Only then can you break through and and continue on your journey to become the strongest. Sky Tower tests its disciples in the harshest ways to prepare them for this journey.One day the lowly sweeper Yang Kai managed to obtain a black book, setting him on the road to the peak of the martials world.", "url": "https://readm.today/manga/martial-peak", "chapters": "3738"}, {"title": "Tales of Demons and Gods", "poster": "https://readm.today/uploads/chapter_files/cover/tbn/1587154566_198x0.jpg", "desc": "Nie Li, the strongest Demon Spiritist in his past life standing at the pinnacle of the martial world however, he lost his life during the battle with Sage Emperor and the six deity ranked beast, his soul was then reborn back in time back to when he is still 13. Although he?s the weakest in his class with the lowest talent at only Red soul realm, but with the aid of the vast knowledge which he accumulated from his previous life, he trained faster then anyone.  Trying to protect the city which in the coming future was being assaulted by beast and ended up being destroyed as well as protecting his lover, friends and family who died by the beast assault. And to destroy the Sacred family whom abandon their duty and betrayed city in his past life.", "url": "https://readm.today/manga/tales-of-demons-and-gods", "chapters": "963"}, {"title": "Apotheosis - Elevation to the status of a god", "poster": "https://readm.today/uploads/chapter_files/cover/tbn/1586957986_198x0.jpg", "desc": "Luo Zheng, now a humble slave was born as the eldest son of a wealthy family. Due to his family's decline, the kidnapping of his sister by a powerful force, he can now only be stepped upon by others. However, heaven never seals off all exits. An ancient book left by his father reveals a secret divine technique, giving the reader immense power! But what is behind this power? This is a contest against fate", "url": "https://readm.today/manga/apotheosis-elevation-to-the-status-of-a-god", "chapters": "1234"}, {"title": "Solo Leveling", "poster": "https://readm.today/uploads/chapter_files/cover/tbn/1596230126_198x0.jpg", "desc": "Not avilable", "url": "https://readm.today/manga/soIo-IeveIing-220424", "chapters": "203"}, {"title": "Versatile Mage", "poster": "https://readm.today/uploads/chapter_files/cover/tbn/1587716567_198x0.jpg", "desc": "He awoke, and the world was changed. The familiar high school now teaches magic, encouraging students to become the greatest magicians they can be. Beyond the city limits, wandering magical beasts prey on humans.An advanced scientific world changed into one with advanced magic. Yet, what has not changed was the same teacher who looks upon him with disdain, the same students who look upon him with contempt, the same father who struggles at the bottom rung of society, and the same innocent step sister who cannot walk. However, Mo Fan discovered that while everyone else can only use one major element, he himself can use all magic!", "url": "https://readm.today/manga/versatile-mage", "chapters": "1165"}, {"title": "The Beginning After the End", "poster": "https://readm.today/uploads/chapter_files/cover/tbn/1715595392_198x0.jpg", "desc": "King Grey has unrivaled strength, wealth, and prestige in a world governed by martial ability. However, solitude lingers closely behind those with great power. Beneath the glamorous exterior of a powerful king lurks the shell of man, devoid of purpose and will.Reincarnated into a new world filled with magic and monsters, the king has a second chance to relive his life. Correcting the mistakes of his past will not be his only challenge, however. Underneath the peace and prosperity of the new world is an undercurrent threatening to destroy everything he has worked for, questioning his role and reason for being born again.", "url": "https://readm.today/manga/the-beginning-after-the-end-170424", "chapters": "197"}, {"title": "Rebirth of the Urban Immortal Cultivator", "poster": "https://readm.today/uploads/chapter_files/cover/tbn/1565191211_198x0.jpg", "desc": "Chen Fanyu died in the midst of divine tribulation, having reached the pinnacle of the cultivation world in less than 500 years. Somehow, despite the loss of his cultivation base, he was able to return to his youth as a university student living on Earth. He decided to once again tread the path to immortality, armed with the knowledge he had gathered in his past life, to overwrite his past mistakes, remove his lingering regrets, and set a firm spiritual foundation that will guarantee success in his inevitable attempt to once again ascend to another plane of existence.", "url": "https://readm.today/manga/rebirth-of-the-urban-immortal-cultivator", "chapters": "985"}, {"title": "Magic Emperor", "poster": "https://readm.today/uploads/chapter_files/cover/tbn/1577381644_198x0.jpg", "desc": "Zhuo Yifan was a magic emperor or could be called a demon emperor because he had an ancient emperor’s book called the Book of the Nine Secrets, he was targeted by all the experts and he was even betrayed and killed by his students. Then his soul enters and comes back to life in a family servant boy named Zhuo Fan. Because some demonic magic is holding him back, he must unite the child’s memories and cannot ignore the family and the mistress he serves. How can he lead this descending family back to the pinnacle of this continent!", "url": "https://readm.today/manga/magic-emperor", "chapters": "550"}, {"title": "Above All Gods", "poster": "https://readm.today/uploads/chapter_files/cover/tbn/1587296955_198x0.jpg", "desc": "The ancient Sirius of the Red King, the capital of the Demon Lord, was besieged by everyone, jealous of heaven, besieged in Chiyan Ridge, judged by heaven, deprived of the foundation of the fairy path, the throne of the magic path, and died However, the ancient Sirius was born 500 years later with a mysterious ancient jade!\nThe enemies of the last life, the revenge of this life, the shame of the last life, the snow of this life! I am an ancient Sirius, and I speak for myself …", "url": "https://readm.today/manga/above-all-gods", "chapters": "973"}, {"title": "One Piece", "poster": "https://readm.today/uploads/chapter_files/cover/tbn/1586509760_198x0.jpg", "desc": "Greatness, Glory, Gold. A Pirate Named Gold Roger also known as the Pirate King has conquered this all. He was executed with an unknown reason but before he died he had revealed his last word about The legendary Treasure named One Piece which was hidden in the Grand Line. 22 years after his Death, A Pirate named Monkey D. Luffy appeared and has only one Goal, To Become the Next \"Pirate King\" and Find The Treasure \"One Piece\". This Start The Never Ending Adventure. Monkey D. Luffy, inspired by his childhood hero \"Red-Haired\" Shanks, sets out on a journey to find the legendary treasure One Piece, to become the new Pirate King, and after eating the devil's fruit gains the power to do so. To accomplish this, he must reach the end of the most deadly and dangerous ocean: The Grand Line. But first he must find a crew.", "url": "https://readm.today/manga/one-piece-150424", "chapters": "1141"}, {"title": "Peerless Battle Spirit", "poster": "https://readm.today/uploads/chapter_files/cover/tbn/1567030967_198x0.jpg", "desc": "In the Canglan Continent, only those that who manage to awaken a Martial Spirit can walk on the path of cultivation. In this world, only those with stronger martial spirits can communicate with the heavens and earth. Qin Nan, born in Linshui City, was a peerless genius who possessed talent and was thought to become a great cultivator in the future. However, things changed when he ended up awakening a grade 1 Martial Spirit, resulting in him being considered as trash.Fortunately enough, Qin Nan was struck by a ray of lightning while practicing his martial arts and coincidentally obtained the Divine Battle Spirit, which was capable of levelling up. Breaking the ultimate rule of the Canglan Continent, little did Qin Nan knew that his Martial Spirit possessed a great secret that will slowly unravel the mystery as the story goes on.Now join Qin Nan and his companion along their journey, battling against various opponents, outsmarting their enemies and seeking the answers to unveil mysteries", "url": "https://readm.today/manga/peerless-battle-spirit", "chapters": "645"}, {"title": "Yuan Zun", "poster": "https://readm.today/uploads/chapter_files/cover/tbn/1526898501_198x0.jpg", "desc": "A teenager holds a pen, while a dragon dances; Chaos surrounds the world, lighting the sky. In this world, will the python swallow the dragon, or will the saint dragon rise?!", "url": "https://readm.today/manga/yuan-zun", "chapters": "1190"}, {"title": "The Great Mage Returns After 4000 Years", "poster": "https://readm.today/uploads/chapter_files/cover/tbn/1588275807_198x0.jpg", "desc": "The worst student of Westrod Academy, the disgrace of the Blake House.A new soul enters the lifeless body of Frey Blake, the boy who couldn’t handle his painful life and chose death instead.“What’s with this body?I’ll have to check every little detail of it.”The Great Mage Lucas Traumen.He earned his chance at revenge by gaining the flesh and bones of Frey Blake the disgrace!And now begins the interesting adventure of the Great Mage who returned after 4000 years!", "url": "https://readm.today/manga/The-Great-Mage-Returns-After-4000-Years-170424", "chapters": "192"}, {"title": "Star Martial God Technique", "poster": "https://readm.today/uploads/chapter_files/cover/tbn/1478192515_198x0.jpeg", "desc": "In the whole world there lays twelve paths to climb Tower of God, and in legends these twelve pathways leads toward legendary road of immortality. However these paths in the Tower of God, are far too long, without end.In ancient times there once were many types of martial arts, sadly the world underwent terrible changes, and only three were left: Flame, Dragon and Star Martial Arts. Generations of experts of those three martial arts are searching for the road of immortality.A Star Martial Arts practitioner on his journey of lifetime, plans to become the Highest God.", "url": "https://readm.today/manga/star-martial-god-technique", "chapters": "744"}, {"title": "Martial Master", "poster": "https://readm.today/uploads/chapter_files/cover/tbn/1587153910_198x0.jpg", "desc": "The legendary martial master Simon was betrayed by friends and persecuted to death. Three hundred years later, he reborn in an illegitimate child of the royal family who was deceived. With his past powers, Simon again creates his legend in this land. Surely, it must be a revenge and reconquer road filled with !", "url": "https://readm.today/manga/martial-master", "chapters": "549"}, {"title": "Ranker Who Lives A Second Time", "poster": "https://readm.today/uploads/chapter_files/cover/tbn/1711712717_198x0.jpg", "desc": "Yeon-woo had a twin brother who disappeared five years ago. One day, a pocket watch left by his brother returned to his possession. Inside, he found a hidden diary in which was recorded “By the time you hear this, I guess I will be already dead….”\nObelisk, the Tower of the Sun God, a world where several universes and dimensions intersect. In this world, his brother had fallen victim to betrayal while climbing up the tower. After learning the truth, Yeon-woo decided to climb the tower along with his brother’s diary.\nYeon-woo then proceeds to go through the same trials and fights as his younger brother did as an anonymous player. His goal? Defeating the Obelisk Tower and get revenge for his brother.", "url": "https://readm.today/manga/ranker-who-Iives-a-second-time-220424", "chapters": "176"}, {"title": "Tomb Raider King", "poster": "https://readm.today/uploads/chapter_files/cover/tbn/1602089729_198x0.jpg", "desc": "The God’s Tombs started to appear around the world. Due to the relics within these tombs, many were able to wield these legendary power for themselves, while others became enslaved to these users. However, a Tomb Raider appears with the purpose of robbing these relics. The Tomb Raider King. “God damn it! Did that bastard already loot this place as well?!” What you own belongs to me. What I own definitely belongs to me. This is the story of a revived Tomb Raider who will do whatever he can to claim all the tombs and relics for himself!", "url": "https://readm.today/manga/Tomb-Raider-King-150424", "chapters": "415"}, {"title": "A Returner's Magic Should Be Special", "poster": "https://readm.today/uploads/chapter_files/cover/tbn/1694101252_198x0.png", "desc": "\"Now that I'm back, I won't allow my loved ones to die again!\"The Shadow Labyrinth - the most catastrophic existence humanity has faced in history.Desir Arman is one of the six remaining survivors of mankind within it.The six attempt to clear the final level of the labyrinth but ultimately fail, and the world comes to an end.However - when Desir thought he would meet his demise, what is revealed before him is the world... thirteen years ago?!Desir is returned to the past, back to the time when he enrolled at the nation's finest magic academy - Havrion. He is reunited with his precious friends, and is prepared to change the past to save the world and his loved ones...!Three years remaining before the emergence of the Shadow World!Change the past and gather powerful comrades to save mankind!", "url": "https://readm.today/manga/a-returners-magic-should-be-special-150424", "chapters": "260"}, {"title": " Martial Arts Reigns", "poster": "https://readm.today/uploads/chapter_files/cover/tbn/1587549791_198x0.jpg", "desc": "Ye Ming, the rising star of Family Ye is regarded as a genius among his peer cultivators. But he was schemed by his jealous cousin and the latter cut his meridians, crippled his abilities and hamstrung him ruthlessly. But Ye Ming never gives up because he’d sacrifice everything for take revenge for his deceased parents who were murdered by Family Huang. But he doesn’t know that he is considered a pain in the neck to Family Ye and a big conspiracy is looming out of the darkness…", "url": "https://readm.today/manga/-martial-arts-reigns", "chapters": "635"}, {"title": "Against the Gods", "poster": "https://readm.today/uploads/chapter_files/cover/tbn/1519512569_198x0.jpg", "desc": "Wielding the Sky Poison Pearl, receiving the blood of an Evil God, cultivating the strength to oppose heaven, a lord overlooking the world!", "url": "https://readm.today/manga/against-the-gods", "chapters": "656"}, {"title": "Nano Machine", "poster": "https://readm.today/uploads/chapter_files/cover/tbn/1591857212_198x0.jpg", "desc": "After being held in disdain and having his life put in danger, an orphan from the Demonic Cult, Cheon Yeo-Woon, has an unexpected visit from his descendant from the future who inserts a nano machine into Cheon Yeo-Woon's body, which drastically changes Cheon Yeo-Woon's life after its activation. The story of Cheon Yeo-Woon's journey of bypassing the Demonic Cult and rising to become the best martial artist has just begun.", "url": "https://readm.today/manga/Nano-Machine-150424", "chapters": "203"}, {"title": "Omniscient Reader's Viewpoint", "poster": "https://readm.today/uploads/chapter_files/cover/tbn/1590522346_198x0.jpg", "desc": "‘This is a development that I know of.’ The moment he thought that, the world had been destroyed, and a new universe had unfolded. The new life of an ordinary reader begins within the world of the novel, a novel that he alone had finished.", "url": "https://readm.today/manga/0MNlSClENT-READERS-VlEWP0INT-220424", "chapters": "212"}, {"title": "Tower of God", "poster": "https://readm.today/uploads/chapter_files/cover/tbn/1587296777_198x0.jpg", "desc": "What do you desire? Fortune? Glory? Power? Revenge? Or something that surpasses all others? What ever you desire, 'that is here'. Tower of God.", "url": "https://readm.today/manga/Tower-of-God-150424", "chapters": "627"}, {"title": "I Have A Dragon In My Body", "poster": "https://readm.today/uploads/chapter_files/cover/tbn/1581363233_198x0.jpg", "desc": "Introducing a generation of Celestial Masters and returning to high school, he was surprised to find that he had a dragon in his body... When you are still very weak and face bullying, will you fight desperately or obey? In the previous life, he obeyed, but in this life... The romantic emperor rushed across the city, turning his hands over the clouds, and there was only one mind in mind: I am the king, and where is he? !!", "url": "https://readm.today/manga/i-have-a-dragon-in-my-body", "chapters": "636"}, {"title": "Overgeared", "poster": "https://readm.today/uploads/chapter_files/cover/tbn/1687169396_198x0.jpg", "desc": "Young Woo Shin, Username: Grid. In the words best virtual reality game , bad luck always revolves around him. But he stumbled across a job during a quest, the strongest legendary job out of over 2 billion players!", "url": "https://readm.today/manga/Overgeared-170424", "chapters": "231"}, {"title": "One-Punch Man", "poster": "https://readm.today/uploads/chapter_files/cover/tbn/1527534783_198x0.jpg", "desc": "imitates the life of an average hero who wins all of his fights with only one punch! This is why he is called Onepunch man Manga. This story takes place in the fictional Z-City. The world is full of mysterious beings, villains and monsters that cause destruction and havoc. An association of heroes has been established to protect the citizens from all harms and enemies. People with superhuman ability can register themselves with the association that protects citizens. There, they will be required to take a series of tests to determine their ability and what class they are. Class S being the highest and class C being the lowest. Saitama is the titular Onepunch man Manga that is so powerful that he can defeat very powerful monsters and villains in just a single punch. Ironically, his life is boring because he is a superhero. The fact that he is so strong and powerful proved to be boring to him as hell. There are a lot of characters in the manga Onepunch man Manga is our favourite in this. Heroes and villains have interesting abilities and very powerful personalities. However, most of them heroes and villain are featured as background and support characters. He used to be your typical Salaryman. He is middle aged and lived a rather boring and normal life. One day he saw a kid being attacked by one of the giant monster lobster. He helped the kid and somehow defeated the monster. From that very day, he decided to become a hero. He chose to train every single day for three years. He was very determined. He trained with an all inhuman’ workout routine of 100 push-ups , 100 sit-ups, 100 squats and 10 kilometers running and eventually gaining superhuman strength and speed. He also lost his hair. Saitama is an amusing and entertaining protagonist.  Genos is a cybog and he saw Saitama’s capabilities and assigned himself as his student. He’s become a hero to revenge against a mysterious robot that killed his entire family. He follows Saitama to gain the strength he needed to achieve his goals. Other attractive Manga:", "url": "https://readm.today/manga/one-punch-man-200324", "chapters": "292"}, {"title": "Martial God Asura", "poster": "https://readm.today/uploads/chapter_files/cover/tbn/1609529572_198x0.jpg", "desc": "One night a mysterious and unexplained phenomenon occurs in the nine provinces. Five years later Chu Feng, a regular outer disciple of the Azure Dragon school, awakens one of the mysterious nine lightning beasts. And discovers an egg sealed inside him.", "url": "https://readm.today/manga/martial-god-asura", "chapters": "791"}, {"title": "The Last Human", "poster": "https://readm.today/uploads/chapter_files/cover/tbn/1586435703_198x0.jpg", "desc": "Zuo Tianchen is the last living human in a mutated zombie-infested city. Just when he was sure he'd died, he finds his soul returned to just before that ill-fated day ten years ago. He swears he'll protect the people important to him this time round and reunite with his past lover. Watch his struggles to survive equipped with his memory of the next ten years!", "url": "https://readm.today/manga/the-last-human", "chapters": "591"}, {"title": "Legend of the Northern Blade", "poster": "https://readm.today/uploads/chapter_files/cover/tbn/1697620160_198x0.jpg", "desc": "When the world was plunged into darkness by the ‘Silent Night’, Martial Artists from all over the place gathered to form the ‘Northern Heavenly Sect’. With overwhelming strength from the Northern Heavenly Sect, the Silent Night was pushed away and the people began to enjoy peace once more. However, as time passed the martial artists from the mainlands began to conspire against the ‘Northern Heavenly Sect’, and eventually caused the death of the Fourth Generation Sect Leader, Jin Kwan-Ho, destroying the sect with it. As everyone left the sect, Jin Kwan-Ho’s only son, Jin Mu-Won was left behind. Mu-Won has never learned anything about martial arts, but he eventually finds the Martial Techniques secretly left behind by his father and begins to acquire the martial arts of the Northern Heavenly Sect. Then one day, a mysterious girl appears before Mu-Won…!!", "url": "https://readm.today/manga/legend-of-the-northern-blade-190424", "chapters": "190"}, {"title": "Ultimate Scheming System", "poster": "https://readm.today/uploads/chapter_files/cover/tbn/1608985847_198x0.png", "desc": "Scamming all day, every day, often venturing alone. He bluffs to get the ultimate power in this cultivation world?! world traveler Xue Que doesn’t always bluff, but he needs to.Term : META Stands for (Most Effective Tactic Available) Metagaming is any strategy, action or method used in a game which transcends a prescribed ruleset, uses external factors to affect the game, or goes beyond the supposed limits or environment set by the game. Another definition refers to the game universe outside of the game itself. (citation needed)", "url": "https://readm.today/manga/ultimate-scheming-system", "chapters": "638"}, {"title": "Boku no Hero Academia", "poster": "https://readm.today/uploads/chapter_files/cover/tbn/1599892837_198x0.jpg", "desc": "The story is set in the modern day, except people with special powers have become commonplace throughout the world. A boy named Izuku Midoriya has no powers, but he still dreams.", "url": "https://readm.today/manga/boku-no-hero-academia-33091", "chapters": "454"}, {"title": "Mercenary Enrollment", "poster": "https://readm.today/uploads/chapter_files/cover/tbn/1606413605_198x0.jpg", "desc": "At the age of eight, Ijin Yu lost his parents in a plane crash and became stranded in a foreign land, forced to become a child mercenary in order to stay alive. He returns home ten years later to be reunited with his family in Korea, where food and shelter are plenty and everything seems peaceful. But Ijin will soon learn that life as a teenager is a whole other feat of survival. With only one year of high school left, Ijin must master new tactics to maneuver his way around the schoolhouse battleground. Can he survive a year of high school? Or rather, will the school be able to survive him?", "url": "https://readm.today/manga/Mercenary-Enrollment-190424", "chapters": "186"}, {"title": "Release That Witch", "poster": "https://readm.today/uploads/chapter_files/cover/tbn/1569193213_198x0.jpg", "desc": "A male engineer transmigrated into another world, and became a prince. This place strikingly resembles the Middle Ages of Europe, but at the same time, it seems kind of different? Witches truly exists, and they even possess magic powers! Magic powers are productive forces! Save the witches, liberate the productive forces! Open map, fight demons, break conspiracies, climb up the science and technology tree, and open the path of hardcore ‘farming’!", "url": "https://readm.today/manga/release-that-witch", "chapters": "540"}, {"title": "Spirit Sword Master", "poster": "https://readm.today/uploads/chapter_files/cover/tbn/1536332820_198x0.jpg", "desc": "Once the spirit sword roars, within heaven, earth and the three worlds, I shall reign as the sovereign! Those who do not submit shall die!", "url": "https://readm.today/manga/spirit-sword-master", "chapters": "531"}, {"title": "Battle Through The Heavens", "poster": "https://readm.today/uploads/chapter_files/cover/tbn/1587296833_198x0.png", "desc": "In a land where there is no magic, a land where the strong make the rules and weak have to obey, a land filled with alluring treasures and beauty, yet also filled with unforeseen danger. Xiao Yan, who has shown talents none had seen in decades, suddenly lost everything three years ago - his powers, his reputation, and his promise to his mother. What sorcery has caused him to lose all of his powers? And why has his fiancee suddenly shown up?", "url": "https://readm.today/manga/battle-through-the-heavens", "chapters": "458"}, {"title": "My Wife is a Demon Queen", "poster": "https://readm.today/uploads/chapter_files/cover/tbn/1550530181_198x0.jpg", "desc": "Listen up folks! I’m living my life with the demon queen!", "url": "https://readm.today/manga/my-wife-is-a-demon-queen", "chapters": "462"}, {"title": "Kimetsu no Yaiba", "poster": "https://readm.today/uploads/chapter_files/cover/tbn/1675880532_198x0.jpg", "desc": "Tanjiro is the eldest son in a family that has lost its father. Tanjiro visits another town one day to sell charcoal, but ends up staying the night at someone else's house instead of going home because of a rumor about a demon that stalks a nearby mountain at night. When he goes home the next day, tragedy is waiting for him.", "url": "https://readm.today/manga/kimetsu-no-yaiba-77777", "chapters": "235"}, {"title": "I'm The Great Immortal", "poster": "https://readm.today/uploads/chapter_files/cover/tbn/1576957515_198x0.jpg", "desc": "The previous life was a peerless genius in the world of immortality. He was killed by 3 celestial beings. He was accidentally reborn to his 20s by the book of heaven. All he wanted to do was to become an immortal and return to the immortal world, and he became the strongest man on the earth, turning his hands into clouds and covering his hands with rain, provoking anyone who defies him! He is the venerable one! The ruler of 3000 worlds! the guy who is 10 000 times better than Thanos! He is Taixuan Taizun! The Great Immortal!", "url": "https://readm.today/manga/im-the-great-immortal", "chapters": "615"}, {"title": "The Survival Story of the Sword King in Another World", "poster": "https://readm.today/uploads/chapter_files/cover/tbn/1712831075_198x0.jpg", "desc": "Ryu Han-Bin was a normal person who just had been discharged from his mandatory military service, when he was transported to another world. Left to fend for himself, he was given the goal of surviving and growing stronger in a desolute world riddled with monsters. The problem is the 'Guideline' that was supposed to be his guiding system to survive is filled with errors.", "url": "https://readm.today/manga/The-Survival-Story-of-the-Sword-King-in-Another-World-190424", "chapters": "208"}, {"title": "Jujutsu Kaisen", "poster": "https://readm.today/uploads/chapter_files/cover/tbn/1703075306_198x0.jpg", "desc": "Yuuji is a genius at track and field. But he has zero interest running around in circles, he's happy as a clam in the Occult Research Club. Although he's only in the club for kicks, things get serious when a real spirit shows up at school! Life's about to get really strange in Sugisawa Town #3 High School!", "url": "https://readm.today/manga/jujutsu-kaisen-588420", "chapters": "261"}]}